const exportUsersToExcel = require('./exportService');

const users = [
    {
        id: 1,
        text1: 'Реакція на власне імя',
        stymuls: 'фотокартка',
        stym1:'іграшка',
        stym2:'улюблений фрукт',
        stym3:'яскрава картинка',
        stym4:'сік',
        instr1:'Перед тим, як покликати дитину, впевніться, що ви в її полі зору (щоб дитина змогла зорієнтуватися). Оцінюйте, якщо дитина вас помічає і позитивно реагує; тоді можна намагатися її кликати.',
        instr2:'Повторіть ті самі процедури, але вже без жестів.\n' +
            'Якщо дитина реагує одразу лише на своє ім’я, оцінюйте «С». Якщо доводиться повторити ім’я або допомогти одним стимулом – «+», якщо не реагує – «-». Практикуйте, доки дитина не почне відгукуватися без додаткових стимулів.',
        instr3:'На цьому етапі дитина повинна реагувати на почуте ім’я одразу і без допомоги стимулів чи жестів. Дитина повинна одразу і без ускладнень реагувати на ваш голос і звертання. Також добре, якщо вона реагує на звертання іншого терапевта. Якщо вона реагує на голос іншого терапевта одразу, оцінюйте «С», якщо реагує з допомогою вашого голосу – «+», якщо не реагує – «-». Практикуйте цю вправу при різних ситуаціях (коли дитина на дворі, в колі дітей, під час гри тощо). ',
        bool_field: 1
    },
    {
        id: 2,
        text1: 2,
        stymuls: 'м’яч',
        stym1:'кулька',
        stym2:'цукерка',
        stym3:'фрукт',
        stym4:'розмальовка',
        instr1: 'На цьому етапі дитина може не миттєво або не одразу відповідати на ваші питання словом «так/ні». Проте намагайтеся ставити такі питання і наводити дитину до такої відповіді. Якщо дитина відповідає з використанням одного стимулу, оцінюйте «С», якщо вам доводиться повторити той стимул, або додати ще один – «+», якщо дитина не реагує абсолютно – «-». Повторяйте доти, доки дитина не почне реагувати одразу або з використанням якось одного стимулу.',
        instr2: 'Тут дитина повинна могти відповідати на питання лише «так/ні». Ви можете повторити питання, намагатися за допомогою інтонації наштовхнути дитину до відповіді, але не використовувати стимули. Також ви можете ускладнювати питання, але спостерігайте, чи дитина на них реагує. Якщо дитина одразу відповідає, оцінюйте «С»; якщо ви кілька разів повторювали питання – «+»; якщо не відповідає після п’яти спроб або взагалі не реагує – «-».',
        instr3: 'На цьому етапі дитина повинна без перешкод відповідати на ваші питання різного типу складності, а також на питання іншого терапевта. Дуже добре, якщо малюк зможе відповідати вам , коли він зайнятий грою або є в компанії друзів. Якщо дитина відповідає іншому терапевту – «С», якщо відповідає після того, як ви повторили це питання – «+», якщо не відповідає – «-». Практикуєте доти, доки дитина не почне безперешкодно відповідати кожному на їхні питання.',
        bool_field: 1
    },
    {
        id: 3,
        text1: 'Запитання/відповідь та комунікація',
        stymuls: 'картинка(будь-якої тематики)',
        instr1: 'На цьому етапі дитина повинна без перешкодJ1:L4 відповідати на ваші питання різного типу складності, а також на питання іншого терапевта. Дуже добре, якщо малюк зможе відповідати вам , коли він зайнятий грою або є в компанії друзів. Якщо дитина відповідає іншому терапевту – «С», якщо відповідає після того, як ви повторили це питання – «+», якщо не відповідає – «-». Практикуєте доти, доки дитина не почне безперешкодно відповідати кожному на їхні питання.',
        instr2: 'На цьому етапі дитина повинна бути пT1:X4овністю сконцентрована на вашому описі і допомагати вам. Якщо дитина відповідає, оцінюйте «С», якщо пасивно – «+», якщо не відповідає – «-».',
        instr3: 'Тут дитина повинна реагувати на пояснення іншого терапевта та на різного типу картинки. Найбільш ефективно, якщо дитина реагує на картинки, які обрали ви. Якщо все так, оцінюйте «С»; якщо якісь ускладнення, то «+»; якщо не реагує – «-». Повторюйте вправу до досягнення очікуваного результату.',
        bool_field: 1
    }
];

const workSheetColumnName = [
    "Number",
    "Text1",
    "Text2",
    "Text3",
    "Stymuls->",
    "",
    "",
    "",
    "",
    "Instructions for first difficulty level ->",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "Instructions for second difficulty level ->",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "Instructions for third difficulty level ->",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "some boolean field"

]

const workSheetName = 'Users';
const filePath = './outputFiles/Book1 (1).xls';

exportUsersToExcel(users, workSheetColumnName, workSheetName, filePath);